Revit 2017 API
Application.IsSubscriptionUpdate Property
 True if this version of Revit is a subscription update.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015 Subscription Update
Syntax
C#
public bool IsSubscriptionUpdate { get; }
Visual Basic
Public ReadOnly Property IsSubscriptionUpdate As Boolean
	Get
Visual C++
public:
property bool IsSubscriptionUpdate {
	bool get ();
}
Remarks
 Subscription update releases may have additional APIs and functionality not available in the standard customer releases. Add-ins written to support standard Revit releases should be compatible with subscription updates, but add-ins written specifically targeting new features in subscription updates would not be compatible with the standard releases.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace